IDENTIFICATION DIVISION.
    PROGRAM-ID. MESSAGELOGIC.

ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
        FILE-CONTROL.
            SELECT MESSAGE-FILE ASSIGN TO 'data/Messages.dat'
                ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
    FILE SECTION.
        FD MESSAGE-FILE.
        01 MESSAGE-RECORD.
            05 MSG-SENDER    PIC X(20).
            05 MSG-RECIPIENT    PIC X(20).
            05 MSG-TIMESTAMP    PIC X(21).
            05 MSG-CONTENT    PIC X(100).
    LOCAL-STORAGE SECTION.
        77 MSG-EOF    PIC X VALUE "N".
        01 LS-MESSAGE-RECORD.
            05 LS-MSG-SENDER    PIC X(20).
            05 LS-MSG-RECIPIENT    PIC X(20).
            05 LS-MSG-TIMESTAMP    PIC X(21).
            05 LS-MSG-CONTENT    PIC X(100).
    LINKAGE SECTION.
        01 MSG-LINK-PARAMETERS.
            05 MSG-LNK-OPERATION    PIC X(3).
            05 MSG-LNK-RETURN-CODE    PIC X.
            05 MSG-LNK-RECORD.
                10 MSG-LNK-SENDER    PIC X(20).
                10 MSG-LNK-RECIPIENT    PIC X(20).
                10 MSG-LNK-TIMESTAMP    PIC X(21).
                10 MSG-LNK-CONTENT    PIC X(100).

PROCEDURE DIVISION USING MSG-LINK-PARAMETERS.
    MOVE "N" TO MSG-LNK-RETURN-CODE
    MOVE MSG-LNK-RECORD TO LS-MESSAGE-RECORD

    EVALUATE MSG-LNK-OPERATION
        WHEN "SNM"
            PERFORM SEND-NEW-MESSAGE
            MOVE "Y" TO MSG-LNK-RETURN-CODE
        WHEN OTHER
            MOVE "N" TO MSG-LNK-RETURN-CODE
    END-EVALUATE
    GOBACK.

    SEND-NEW-MESSAGE.
        OPEN EXTEND MESSAGE-FILE
        MOVE LS-MESSAGE-RECORD TO MESSAGE-RECORD
        WRITE MESSAGE-RECORD
        CLOSE MESSAGE-FILE.
