IDENTIFICATION DIVISION.
    PROGRAM-ID. MESSAGELOGIC.

ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
        FILE-CONTROL.
            SELECT MESSAGE-FILE ASSIGN TO 'data/Messages.dat'
                ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
    FILE SECTION.
        FD MESSAGE-FILE.
        01 MESSAGE-RECORD.
            05 MSG-SENDER    PIC X(20).
            05 MSG-RECIPIENT    PIC X(20).
            05 MSG-TIMESTAMP    PIC X(21).
            05 MSG-CONTENT    PIC X(100).
    LOCAL-STORAGE SECTION.
        77 MSG-EOF    PIC X VALUE "N".
        01 LS-MESSAGE-RECORD.
            05 LS-MSG-SENDER    PIC X(20).
            05 LS-MSG-RECIPIENT    PIC X(20).
            05 LS-MSG-TIMESTAMP    PIC X(21).
            05 LS-MSG-CONTENT    PIC X(100).
    LINKAGE SECTION.
        01 MSG-LINK-PARAMETERS.
            05 MSG-LNK-OPERATION    PIC X(3).
            05 MSG-LNK-RETURN-CODE    PIC X.
            05 MSG-LNK-RECORD.
                10 MSG-LNK-SENDER    PIC X(20).
                10 MSG-LNK-RECIPIENT    PIC X(20).
                10 MSG-LNK-TIMESTAMP    PIC X(21).
                10 MSG-LNK-CONTENT    PIC X(100).
           05 MSG-LNK-USERNAME        PIC X(20).
           05 MSG-LNK-NUM-RECORDS     PIC 9(3).
           05 MSG-LNK-RECORDS OCCURS 100 TIMES.
               10 MSG-LNK-REC-SENDER  PIC X(20).
               10 MSG-LNK-REC-RECIPIENT   PIC X(20).
               10 MSG-LNK-REC-TIMESTAMP   PIC X(21).
               10 MSG-LNK-REC-CONTENT     PIC X(100).




PROCEDURE DIVISION USING MSG-LINK-PARAMETERS.
    MOVE "N" TO MSG-LNK-RETURN-CODE


    EVALUATE MSG-LNK-OPERATION
        WHEN "SNM"
           MOVE MSG-LNK-RECORD TO LS-MESSAGE-RECORD
            PERFORM SEND-NEW-MESSAGE
            MOVE "Y" TO MSG-LNK-RETURN-CODE
       WHEN "VWM"
           PERFORM VIEW-MESSAGES
        WHEN OTHER
            MOVE "N" TO MSG-LNK-RETURN-CODE
    END-EVALUATE
    GOBACK.

    SEND-NEW-MESSAGE.
        OPEN EXTEND MESSAGE-FILE
        MOVE LS-MESSAGE-RECORD TO MESSAGE-RECORD
        WRITE MESSAGE-RECORD
        CLOSE MESSAGE-FILE.

    VIEW-MESSAGES.
       MOVE 0 TO MSG-LNK-NUM-RECORDS
       MOVE "N" TO MSG-EOF

       OPEN INPUT MESSAGE-FILE

       PERFORM UNTIL MSG-EOF = "Y"
           READ MESSAGE-FILE
               AT END
                   MOVE "Y" TO MSG-EOF
               NOT AT END
                   IF FUNCTION TRIM(MSG-RECIPIENT) = FUNCTION TRIM(MSG-LNK-USERNAME)
                       ADD 1 TO MSG-LNK-NUM-RECORDS
                       MOVE MSG-SENDER TO MSG-LNK-REC-SENDER (MSG-LNK-NUM-RECORDS)
                       MOVE MSG-RECIPIENT TO MSG-LNK-REC-RECIPIENT (MSG-LNK-NUM-RECORDS)
                       MOVE MSG-TIMESTAMP TO MSG-LNK-REC-TIMESTAMP (MSG-LNK-NUM-RECORDS)
                       MOVE MSG-CONTENT TO MSG-LNK-REC-CONTENT (MSG-LNK-NUM-RECORDS)
                   END-IF
           END-READ
       END-PERFORM

       CLOSE MESSAGE-FILE

       IF MSG-LNK-NUM-RECORDS > 0
           MOVE "Y" TO MSG-LNK-RETURN-CODE
       ELSE
           MOVE "N" TO MSG-LNK-RETURN-CODE
       END-IF.
